[
    {"name":"Balsamic Mushrooms",
        "num_served":3,
        "ingredients":
            [{"name":"mushrooms",
                "amount":"12",
                "units":"medium",
                "description":"Mushrooms"},
                {"name":"balsamic vinegar",
                    "amount":"1/4",
                    "units":"cup",
                    "description":"Balsamic vinegar"},
                {"name":"red wine",
                    "amount":"1/8",
                    "units":"cup",
                    "description":"Red wine"}],
        "directions":
            ["Place all ingredients in a (preferably nonstick) pan and let sit for a few minutes.",
                "Then cook covered over medium heat for about three minutes until they are soft.",
                "Remove the cover and cook until the liquid is almost gone, then serve."]},
    {"name":"Barbecued Eggplant",
        "num_served":2,
        "ingredients":
            [{"name":"eggplant",
                "amount":"1",
                "units":"",
                "description":"eggplant"},
                {"name":"barbecue sauce",
                "amount":"1/4",
                "units":"cup",
                "description":"Eggplant Barbecue Sauce salt"}],
        "directions":
            ["Preheat the oven to 350 degrees. Peel and cut the eggplant into 1/3-inch  thick slices. Salt the slices. Place on a rack or colander and let stand  for 30 minutes. Wipe off salt with a clean kitchen towel. Lay the slices  out on a lightly oiled baking sheet. Brush on barbecue sauce. Bake for 15  minutes. Turn over, brush with barbecue sauce, and bake for 15 minutes more  or until the eggplant is tender but not mushy."]},
    {"name":"Lemon Sesame Broccoli",
        "num_served":4,
        "ingredients":
            [{"name":"broccoli",
                "amount":"2",
                "units":"cup",
                "description":"Broccoli"},
                {"name":"sesame oil",
                    "amount":"2",
                    "units":"teaspoon",
                    "description":"Sesame oil"},
                {"name":"lemon juice (fresh)",
                    "amount":"1/2",
                    "units":"tablespoon",
                    "description":"fresh lemon juice"},
                {"name":"black pepper",
                    "amount":"1/4",
                    "units":"teaspoon",
                    "description":"black pepper"},
                {"name":"salt", "amount":"1", "units":"teaspoon", "description":"Salt"}],
        "directions":
            ["Cut flowerets off of the broccoli and cut into small pieces.",
                "Cut the stems into very thin round pieces so they will cook quickly.",
                "Put the broccoli stems into  boiling water in saucepan, cover and cook for 3 minutes.",
                "Add flowerets, cover and cook 5 minutes, and then drain all broccoli and place in a serving bowl.",
                "Mix broccoli well with the sesame oil, lemon juice, salt, and black pepper. Eat immediately"]},
    {"name":"Cauliflower and Broccoli Pizza Crust",
        "num_served":4,
        "ingredients":
            [{"name":"cauliflower",
                "amount":"5",
                "units":"cup",
                "description":"Broccoli"},
        {"name":"Optional: broccoli",
            "amount":"1",
            "units":"cup",
            "description":"Broccoli"},
                {"name":"fresh garlic (peeled and coarsely chopped)",
                    "amount":"1",
                    "units":"",
                    "description":"Cloves garlic,crushed"},
                {"name":"parmesan cheese",
                    "amount":"1/4",
                    "units":"cup",
                    "description":"parmesan cheese"},
                {"name":"mozzarella cheese (finely chopped)",
                    "amount":"1/4",
                    "units":"cup",
                    "description":"mozzarella cheese"},
                {"name":"dried basil",
                    "amount":"1",
                    "units":"teaspoon",
                    "description":"basil"},
                {"name":"black pepper",
                    "amount":"1/4",
                    "units":"teaspoon",
                    "description":"black pepper"},
                {"name":"salt", "amount":"1/4", "units":"teaspoon", "description":"Salt"},
                {"name":"Optional: red pepper flakes", "amount":"1/2", "units":"teaspoon", "description":"red pepper flakes"},
                {"name":"egg", "amount":"1", "units":"", "description":"egg"},
                {"name":"olive oil",
                    "amount":"1/2",
                    "units":"teaspoon",
                    "description":"olive oil"}
            ],
        "directions":
            ["This crust contains no wheat or other grains: very healthy and very tasty!",
                "You will need parchment (baking) paper to make this recipe. Preheat oven to 425F. Place either a pizza stone or a large baking pan in the oven. Note: 1 medium large cauliflower is about 5 cups, coarsely chopped.",
             "This recipe is just for the pizza crust. It is delicious! The broccoli is optional; in its place you can use a little more cauliflower. However, this is a good way to get people (kids!) to eat vegetables, so sneak in a little broccoli.",
                "Chop up the cauliflower, broccoli, and garlic. Put in a food processor and spend a few minutes getting it all chopped to a very fine consistency. Transfer to a bowl.",
                "This finely chopped mixture now needs to be broken down by cooking in a microwave oven for about 3 minutes. Cover the bowl in the microwave oven.",
                "You will need to get the water out of the mixture: get a clean dish towel and spread it over a large cutting board. Dump the hot mixture in the center of the towel and then let it sit for about 5 minutes to cool down.",
                "Carefully fold up the dish towel to avoid spilling any of the mixture and over the sink \"wring out\" as much water as you can. I spend about two minutes doing this.",
                "Return the (almost dry) mixture to the bowel (wipe it out first if there is much moisture in it) and add the mozzarella cheese, parmesan cheese, dried basil, peper, salt, and (optional) red pepper flakes.",
                "Blend everything together, then add a raw egg and mix together.",
                "Cut a piece of parchment paper, put it on a cutting board and poor the olive oil in the center. You should have the bowl of mixed ingredients right beside the parchment paper for easy access.",
                "With your (washed) hands, spread out the oil on the parchment paper into abut a 10 inch circle, pick up the mixture in the bowl with your hands and place it on the paper. Push the mixture down to make a circle about 3/8 of an inch high. With your fingers, push the edges of the pizza dough back towards the center a bit if there are areas where the material is thin. Try to get the same height.",
                "You will carefully slide the parchment paper onto the pizza stone (or baking sheet) in the oven. I don't worry too much about letting heat out of the oven so I do this process slowly and carefully: to avoid burning myself I like to pull the oven rack abut 1/3 of the way out of the oven to make it safer to slide the parchment paper onto the pizza stone.",
                "Shut the oven and cook for about 10 minutes. It will be cooked more later after you put sauce on the crust.",
                "Take the entire pizza stone (or baking sheet) out of the oven and place it on top of the stove. Add your favorite pizza sauce and toppings and then put it back in the oven and bake the pizza for another 8 minutes.",
                "IDEAS FOR PIZZA TOPPING: I like to use a small amount of marinara sauce, chopped onion, and cheese. The pizza crust is very good on its own, so you can go light on the toppings."],
        "pictures":
            [
                ["cauliflower_pizza_crust_1", "&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Cooling crust mixture"],
                ["cauliflower_pizza_crust_2", "&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Crust formed, in oven"],
                ["cauliflower_pizza_crust_3", "&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Pizza topping added."],
                ["cauliflower_pizza_crust_4", "&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Cooked pizza"]
            ]
    }



]
